 { bibtex_key: 'Jäger2016457',
    title: 'An evolutionary algorithm for an agent-based fleet simulation focused on electric vehicles',
    author: 'Jäger, B. and Hahn, C. and Lienkamp, M.',
    journal: 'Proceedings - 2016 International Conference on Collaboration Technologies and Systems, CTS 2016',
    year: '2016',
    source: 'Scopus',
    pages: '457-464',
    volume: '',
    abstract: 'This paper presents a multi-agent simulation for fleet applications with a primary focus on electric vehicles. The overall system design is characterized by a distributed and decentralized structure. Basic idea is to use an evolutionary algorithm in combination with a Monte Carlo method to optimize behavioral patterns of agents. Within an iterative process, agent plans are executed, scored and modified - if necessary. In doing so, a set of activity schedules is created that is compatible with given constraints, such as range restrictions of electric cars or space limitations at charging stations. In so doing agents compete with each other for limited resources within a single iteration step. The proposed model makes use of a map-based approach that takes time variant traffic conditions into account. With help of speed profiles and a longitudinal vehicle dynamic model, travel time and energy consumption calculations are carried out. As the fleet and the charging infrastructure configuration are input parameters of the proposed model, it is possible to perform case studies for several electrification scenarios. In total two different scenarios are explored. First the proposed simulation model is validated with help of measured fleet data. Second the suitability of electric cars for a taxi use case is assessed. Within the first simulation study, the daily mileage is reflected with an average variation of 7.8 % and waiting times with an average deviation of 0.05 %. The second electrification scenario provides transparent indications for choosing both an appropriate electric vehicle concept and charging infrastructure configuration. © 2016 IEEE.',
    document_type: 'conference',
    doi: '10.1109/CTS.2016.85',
    url: 'https://www.scopus.com/inward/record.uri?eid=2-s2.0-85016933882&doi=10.1109%2fCTS.2016.85&partnerID=40&md5=e95757e2e446041c23c66d59df73aab5',
    affiliation: 'Institute of Automotive Technology, Technical University of Munich, Munich, Germany',
    author_keywords: 'Charging infrastructure;  Electric vehicle;  Electrification;  Evolutionary computation;  Fleet simulation;  Intelligent vehicles;  Multi-agent systems;  Transportation',
    keywords: 'Electric automobiles;  Electric utilities;  Electric vehicles;  Energy utilization;  Evolutionary algorithms;  Intelligent agents;  Intelligent vehicle highway systems;  Iterative methods;  Monte Carlo methods;  Multi agent systems;  Software agents;  Taxicabs;  Transportation;  Travel time;  Vehicles, Behavioral patterns;  Charging infrastructures;  Decentralized structures;  Electrification;  Fleet simulation;  Multi agent simulation;  Traffic conditions;  Vehicle dynamic model, Fleet operatio',
    publisher: 'Institute of Electrical and Electronics Engineers Inc.',
    issn: '',
    language: 'English',
    note: 'cited By 0; Conference of 2016 International Conference on Collaboration Technologies and Systems, CTS 2016 ; Conference Date: 31 October 2016 Through 4 November 2016;  Conference Code:126763',
    selection_criteria: 'publicações que possuam evidência ou relato da aplicação de conceitos de inteligência artificial em gestão e operação de frota.',
    created_at: '43233,9983564815',
    updated_at: '43254,9297685185',
    created_by: 'gxferreira',
    updated_by: 'gxferreira',
    status: 'Accepted',
    comments: '' },
  { bibtex_key: 'Calvet2016408',
    title: 'A simheuristic for the heterogeneous site-dependent asymmetric VRP with stochastic demands',
    author: 'Calvet, L. and Pagès-Bernaus, A. and Travesset-Baro, O. and Juan, A.A.',
    journal: 'Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)',
    year: '2016',
    source: 'Scopus',
    pages: '408-417',
    volume: '9868 LNAI',
    abstract: 'Rich Vehicle Routing Problems (RVRPs) refer to complex and realistic extensions of the classical Vehicle Routing Problem. They constitute a hot topic in logistics due to their high number of relevant applications. This work focuses on a RVRP with the following characteristics: (a) heterogeneous fleet of vehicles, (b) site-dependency, i.e., not all types of vehicle can reach all customers, (c) asymmetric costs, and (d) stochastic demands.We formally define the problem and describe real-life applications. Our main contribution is a simheuristic-based methodology including a Successive Approximations Method for solving it. A computational experiment is carried out to illustrate the proposed methodology. Moreover, the suitability of considering a simheuristic approach is analyzed. © Springer International Publishing Switzerland 2016.',
    document_type: 'article',
    doi: '10.1007/978-3-319-44636-3_38',
    url: 'https://www.scopus.com/inward/record.uri?eid=2-s2.0-84988589072&doi=10.1007%2f978-3-319-44636-3_38&partnerID=40&md5=1393924b4f104e6f076e5e1357c6a7dc',
    affiliation: 'Computer Science Department, Open University of Catalonia - IN3, Castelldefels, Spain; Observatori de la Sostenibilitat d’Andorra (OBSA), Sant Julià de Lòria, Andorra',
    author_keywords: 'Heterogeneous VRP;  Metaheuristics;  Simheuristics;  Site-dependent VRP;  Stochastic optimization problems;  Successive approximations method',
    keywords: 'Approximation theory;  Artificial intelligence;  Optimization;  Stochastic systems;  Vehicle routing;  Vehicles, Heterogeneous VRP;  Meta heuristics;  Simheuristics;  Site-dependent VRP;  Stochastic optimization problems;  Successive approximations, Fleet operations',
    publisher: 'Springer Verlag',
    issn: '03029743',
    language: 'English',
    note: 'cited By 0; Conference of 17th Conference of the Spanish Association for Artificial Intelligence, CAEPIA 2016 ; Conference Date: 14 September 2016 Through 17 September 2016;  Conference Code:181619',
    selection_criteria: 'publicações que possuam evidência ou relato da aplicação de conceitos de inteligência artificial em gestão e operação de frota.',
    created_at: '43233,9983564815',
    updated_at: '43254,9313078704',
    created_by: 'gxferreira',
    updated_by: 'gxferreira',
    status: 'Accepted',
    comments: '' },
  { bibtex_key: 'Koç201633',
    title: 'The fleet size and mix location-routing problem with time windows: Formulations and a heuristic algorithm',
    author: 'Koç, Ç. and Bektaş, T. and Jabali, O. and Laporte, G.',
    journal: 'European Journal of Operational Research',
    year: '2016',
    source: 'Scopus',
    pages: '33-51',
    volume: '248',
    abstract: 'This paper introduces the fleet size and mix location-routing problem with time windows (FSMLRPTW) which extends the location-routing problem by considering a heterogeneous fleet and time windows. The main objective is to minimize the sum of vehicle fixed cost, depot cost and routing cost. We present mixed integer programming formulations, a family of valid inequalities and we develop a powerful hybrid evolutionary search algorithm (HESA) to solve the problem. The HESA successfully combines several metaheuristics and offers a number of new advanced efficient procedures tailored to handle heterogeneous fleet dimensioning and location decisions. We evaluate the strengths of the proposed formulations with respect to their ability to find optimal solutions. We also investigate the performance of the HESA. Extensive computational experiments on new benchmark instances have shown that the HESA is highly effective on the FSMLRPTW. © 2015 Elsevier B.V. and Association of European Operational Research Societies (EURO) within the International Federation of Operational Research Societies (IFORS). All rights reserved.',
    document_type: 'article',
    doi: '10.1016/j.ejor.2015.06.082',
    url: 'https://www.scopus.com/inward/record.uri?eid=2-s2.0-84940889504&doi=10.1016%2fj.ejor.2015.06.082&partnerID=40&md5=27bfb6a207d2350b9c464f9d6e25fc3c',
    affiliation: 'Southampton Business School, Centre for Operational Research, Management Science and Information Systems (CORMSIS), University of Southampton, Southampton, United Kingdom; CIRRELT and HEC Montréal, Montréal, Canada; CIRRELT, Canada Research Chr. in Distribution Management and HEC Montréal, Montréal, Canada',
    author_keywords: 'genetic algorithm;  heterogeneous fleet;  location-routing;  mixed integer programming;  time windows',
